---
kind: method
id: M:Autodesk.Revit.DB.FailureMessageAccessor.CloneFailureMessage
source: html/4eca4b65-e0e4-dc70-19a9-4148814026f4.htm
---
# Autodesk.Revit.DB.FailureMessageAccessor.CloneFailureMessage Method

Creates a copy of the FailureMessage.

## Syntax (C#)
```csharp
public FailureMessage CloneFailureMessage()
```

## Returns
Copy of the FailureMesassge.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This FailureMessageAccessor has not been properly initialized.